testing-scripts/test_multi-client_encrypted_h2load_throughput_via-B/results/payload-size_100000000____delay-ms_0____loss-rate-percent_0____clients-requests_10/7/result.txt
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 10.27s, 0.97 req/s, 92.92MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 953.97MB (1000305930) total, 130B (130) headers (space savings 86.46%), 953.67MB (1000000000) data
UDP datagram: 37609 sent, 821351 received
                     min         max         mean         sd        +/- sd
time for request:      9.37s      10.26s       9.98s    269.51ms    70.00%
time for connect:     4.13ms     25.59ms     14.77ms      7.17ms    60.00%
time to 1st byte:    25.39ms     29.10ms     27.27ms      1.39ms    60.00%
req/s           :       0.10        0.11        0.10        0.00    80.00%